<a href="https://colab.research.google.com/github/AadarshS9/Computational-Statistics-S3/blob/main/Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
#1.Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.
import pandas as pd
student_data = pd.DataFrame({'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print(student_data)
print("\n")
print('Mean, min, and max value of age for each value of the school')
print("------------------------------------------------------------")
grouped = student_data.groupby('school').agg({'age': ['mean', 'min', 'max']})
print(grouped)

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12     192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13     186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14     151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12     159      32  street4


Mean, min, and max value of age for each value of the school
------------------------------------------------------------
         age
        mean min max
school
s001    12.5  12  13
s002    13.0  12  14
s003    13.0  13  13
s004    12.0  12  12

In [26]:
#2.Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).
import pandas as pd
orders_data = pd.DataFrame({'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
  'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
  'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
  'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
  'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

print(orders_data)
print("\n")
print("Mean, min, and max values of purchase amount (purch_amt) group by customer id  (customer_id)")
print("--------------------------------------------------------------------------------------------")
grouped = orders_data.groupby('customer_id').agg({'purch_amt': ['mean', 'min', 'max']})
print(grouped)

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001


Mean, min, and max values of purchase amount (purch_amt) group by customer id  (customer_id)
--------------------------------------------------------------------------------------------
               purch_amt
                    mean      min      max
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333    65.26  5760.00
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000   110.50  2480.40

In [25]:
#3.Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.
import pandas as pd
student_data = pd.DataFrame({'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print(student_data)
print("\n")
print('Mean, min, and max value of age for each value of the school')
print("------------------------------------------------------------")
grouped = student_data.groupby('school').agg({'age': ['mean', 'min', 'max']})
print(grouped)

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12     192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13     186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14     151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12     159      32  street4


Mean, min, and max value of age for each value of the school
------------------------------------------------------------
         age
        mean min max
school
s001    12.5  12  13
s002    13.0  12  14
s003    13.0  13  13
s004    12.0  12  12

In [24]:
#4.Write a Pandas program to split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school.
import pandas as pd
student_data = pd.DataFrame({'school': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    ' height ': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print(student_data)
print("\n")
print('Mean, min, and max value of age for each school with customized column names')
print("----------------------------------------------------------------------------")
grouped = student_data.groupby('school').agg(Age_Mean = ('age','mean'),Age_Max=('age',max),Age_Min=('age',min))
print(grouped)

   school class            name date_Of_Birth   age   height   weight  address
S1   s001     V  Alberto Franco     15/05/2002   12       173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12       192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13       186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13       167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14       151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12       159      32  street4


Mean, min, and max value of age for each school with customized column names
----------------------------------------------------------------------------
        Age_Mean  Age_Max  Age_Min
school
s001        12.5       13       12
s002        13.0       14       12
s003        13.0       13       13
s004        12.0       12       12

In [23]:
#5.Write a Pandas program to split a given dataframe into groups and create a new column with count from GroupBy.
import pandas as pd
df = pd.DataFrame({'book_name':['Book1','Book2','Book3','Book4','Book1','Book2','Book3','Book5'],
  'book_type':['Math','Physics','Computer','Science','Math','Physics','Computer','English'],
  'book_id':[1,2,3,4,1,2,3,5]})

print(df)
print("\n")
print("New column with count from groupby")
print("----------------------------------")
grouped = df.groupby(["book_name", "book_type"])["book_type"].count().reset_index(name="count")
print(grouped)

  book_name book_type  book_id
0     Book1      Math        1
1     Book2   Physics        2
2     Book3  Computer        3
3     Book4   Science        4
4     Book1      Math        1
5     Book2   Physics        2
6     Book3  Computer        3
7     Book5   English        5


New column with count from groupby
----------------------------------
  book_name book_type  count
0     Book1      Math      2
1     Book2   Physics      2
2     Book3  Computer      2
3     Book4   Science      1
4     Book5   English      1